{"keras_version": "2.0.8", "backend": "tensorflow", "config": [{"config": {"name": "conv2d_1", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "use_bias": true, "dtype": "float32", "strides": [1, 1], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 1, 48, 48], "kernel_regularizer": null, "padding": "valid", "kernel_constraint": null, "activation": "relu", "filters": 16, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_constraint": null, "activation": "linear", "filters": 16, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_constraint": null, "activation": "relu", "filters": 32, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_4", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_constraint": null, "activation": "linear", "filters": 32, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_5", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_constraint": null, "activation": "relu", "filters": 32, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_6", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "data_format": "channels_first", "kernel_size": [3, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "kernel_constraint": null, "activation": "linear", "filters": 32, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_constraint": null, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "epsilon": 0.001, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "activation": "relu", "units": 128}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "activation": "relu", "units": 64}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "rate": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "activation": "relu", "units": 32}, "class_name": "Dense"}, {"config": {"name": "dense_4", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "trainable": true, "activation": "softmax", "units": 6}, "class_name": "Dense"}], "class_name": "Sequential"}