{"backend": "tensorflow", "keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "filters": 16, "bias_regularizer": null, "strides": [1, 1], "dtype": "float32", "kernel_size": [3, 3], "activation": "relu", "padding": "valid", "data_format": "channels_first", "kernel_regularizer": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 1, 48, 48], "use_bias": true, "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "filters": 16, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "activation": "linear", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "momentum": 0.99, "epsilon": 0.001, "beta_regularizer": null, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "activation": "relu", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "activation": "linear", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "momentum": 0.99, "epsilon": 0.001, "beta_regularizer": null, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "activation": "linear", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "momentum": 0.99, "epsilon": 0.001, "beta_regularizer": null, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_constraint": null, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "valid", "activation": "linear", "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "name": "conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "use_bias": true, "bias_constraint": null, "data_format": "channels_first", "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "momentum": 0.99, "epsilon": 0.001, "beta_regularizer": null, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.4}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_regularizer": null, "units": 128, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_regularizer": null, "units": 64, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.1}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_regularizer": null, "units": 32, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "softmax", "kernel_regularizer": null, "units": 6, "name": "dense_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null}}]}