{"keras_version": "2.0.8", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 1, 48, 48], "name": "conv2d_1", "bias_constraint": null, "filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dtype": "float32", "trainable": true, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_first", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_2", "bias_constraint": null, "filters": 16, "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_first", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "name": "batch_normalization_1", "center": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_3", "bias_constraint": null, "filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_first", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_4", "bias_constraint": null, "filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_first", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "name": "batch_normalization_2", "center": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_5", "bias_constraint": null, "filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_first", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "name": "batch_normalization_3", "center": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_6", "bias_constraint": null, "filters": 32, "kernel_size": [3, 3], "activity_regularizer": null, "dilation_rate": [1, 1], "activation": "linear", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_first", "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "name": "batch_normalization_4", "center": true, "gamma_regularizer": null, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.4, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 128}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 64}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.1, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "dense_3", "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 32}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "name": "dense_4", "activity_regularizer": null, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "kernel_constraint": null, "units": 6}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}