{"keras_version": "2.0.8", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, 1, 48, 48], "kernel_size": [3, 3], "name": "conv2d_1", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 16, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_first", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_2", "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 16, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_first", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_1", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_3", "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "filters": 32, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_first", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_4", "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 32, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_first", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_2", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_5", "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 32, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_first", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_3", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_6", "activity_regularizer": null, "padding": "valid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "filters": 32, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_first", "dilation_rate": [1, 1], "strides": [1, 1], "use_bias": true, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_4", "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"rate": 0.4, "trainable": true, "name": "dropout_1"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "units": 128, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "use_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_2", "activity_regularizer": null, "units": 64, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "use_bias": true}}, {"class_name": "Dropout", "config": {"rate": 0.1, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_3", "activity_regularizer": null, "units": 32, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "use_bias": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_4", "activity_regularizer": null, "units": 6, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "softmax", "use_bias": true}}], "backend": "tensorflow"}