{"config": [{"config": {"kernel_size": [3, 3], "name": "conv2d_1", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "filters": 16, "trainable": true, "activation": "relu", "data_format": "channels_first", "batch_input_shape": [null, 1, 48, 48], "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "filters": 16, "trainable": true, "activation": "linear", "padding": "valid", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_1", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "filters": 32, "trainable": true, "activation": "relu", "padding": "valid", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_4", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "filters": 32, "trainable": true, "activation": "linear", "padding": "valid", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_2", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_5", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "filters": 32, "trainable": true, "activation": "linear", "padding": "valid", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_3", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_6", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "data_format": "channels_first", "filters": 32, "trainable": true, "activation": "linear", "padding": "valid", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "dilation_rate": [1, 1], "strides": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_4", "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "center": true, "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "rate": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "kernel_constraint": null, "trainable": true, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_constraint": null, "trainable": true, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "rate": 0.1, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "kernel_constraint": null, "trainable": true, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dense_4", "kernel_constraint": null, "trainable": true, "activation": "softmax", "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 6, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.0.8"}