{"config": [{"config": {"kernel_size": [3, 3], "data_format": "channels_first", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 1, 48, 48], "dilation_rate": [1, 1], "strides": [1, 1], "dtype": "float32", "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "padding": "valid", "activation": "relu", "filters": 16}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 16, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "name": "conv2d_2", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "name": "conv2d_3", "activation": "relu"}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "name": "conv2d_4", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "name": "batch_normalization_2", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "name": "conv2d_5", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "name": "batch_normalization_3", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_first", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "strides": [1, 1], "filters": 32, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "name": "conv2d_6", "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "axis": -1, "gamma_regularizer": null, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "momentum": 0.99, "beta_constraint": null, "center": true, "name": "batch_normalization_4", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.4, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "units": 128, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "units": 64, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "rate": 0.1, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "units": 32, "activation": "relu"}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_4", "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "units": 6, "activation": "softmax"}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential", "backend": "tensorflow"}