{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "filters": 16, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "dilation_rate": [1, 1], "activation": "relu", "padding": "valid", "kernel_regularizer": null, "batch_input_shape": [null, 1, 48, 48], "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "filters": 16, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "padding": "valid", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "center": true, "axis": -1, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "filters": 32, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "padding": "valid", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "filters": 32, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "padding": "valid", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "center": true, "axis": -1, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "filters": 32, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "padding": "valid", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "filters": 32, "bias_regularizer": null, "data_format": "channels_first", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "linear", "padding": "valid", "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "strides": [1, 1], "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "scale": true, "center": true, "axis": -1, "gamma_constraint": null, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "units": 128, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "units": 64, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "relu", "units": 32, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"name": "dense_4", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "activation": "softmax", "units": 6, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}], "keras_version": "2.0.8", "backend": "tensorflow"}