{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_first", "strides": [1, 1], "batch_input_shape": [null, 1, 48, 48], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "dtype": "float32", "filters": 16, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "filters": 16, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "activation": "relu", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "pool_size": [2, 2], "padding": "valid", "trainable": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_first", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "padding": "valid", "trainable": true, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "activation": "linear", "use_bias": true, "kernel_size": [3, 3], "filters": 32, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "scale": true, "epsilon": 0.001, "beta_constraint": null, "center": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"rate": 0.4, "name": "dropout_1", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activation": "relu", "units": 128, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activation": "relu", "units": 64, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "activation": "relu", "units": 32, "bias_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "activation": "softmax", "units": 6, "bias_regularizer": null, "kernel_regularizer": null}}], "backend": "tensorflow", "keras_version": "2.0.8"}