{"class_name": "Sequential", "keras_version": "2.0.8", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "name": "conv2d_1", "trainable": true, "data_format": "channels_first", "bias_regularizer": null, "dtype": "float32", "activity_regularizer": null, "batch_input_shape": [null, 1, 48, 48], "padding": "valid", "bias_constraint": null, "kernel_size": [3, 3], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "name": "conv2d_2", "trainable": true, "data_format": "channels_first", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "axis": -1, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "name": "conv2d_3", "trainable": true, "data_format": "channels_first", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "bias_constraint": null, "use_bias": true, "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "name": "conv2d_4", "trainable": true, "data_format": "channels_first", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "axis": -1, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "name": "conv2d_5", "trainable": true, "data_format": "channels_first", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "axis": -1, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "name": "conv2d_6", "trainable": true, "data_format": "channels_first", "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "bias_constraint": null, "use_bias": true, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "axis": -1, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "momentum": 0.99, "gamma_constraint": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.4}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"units": 128, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Dense", "config": {"units": 64, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.1}}, {"class_name": "Dense", "config": {"units": 32, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 6, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "use_bias": true, "activation": "softmax"}}]}