{"backend": "tensorflow", "config": [{"config": {"name": "conv2d_1", "kernel_size": [3, 3], "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "filters": 16, "dtype": "float32", "padding": "valid", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 1, 48, 48], "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_2", "kernel_size": [3, 3], "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "filters": 16, "padding": "valid", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_1", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_3", "kernel_size": [3, 3], "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "filters": 32, "padding": "valid", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_4", "kernel_size": [3, 3], "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "filters": 32, "padding": "valid", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_2", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_5", "kernel_size": [3, 3], "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "filters": 32, "padding": "valid", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "conv2d_6", "kernel_size": [3, 3], "data_format": "channels_first", "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "filters": 32, "padding": "valid", "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "batch_normalization_3", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "batch_normalization_4", "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "scale": true, "center": true, "axis": -1, "trainable": true, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "beta_constraint": null, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_4", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "use_bias": true, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "use_bias": true, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "use_bias": true, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dense_4", "use_bias": true, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 6, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "keras_version": "2.0.8", "class_name": "Sequential"}