{"backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "name": "conv2d_1", "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dtype": "float32", "activation": "relu", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 1, 48, 48], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "data_format": "channels_first"}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_2", "filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "name": "batch_normalization_1", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "scale": true, "center": true, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_3", "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_4", "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "name": "batch_normalization_2", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "scale": true, "center": true, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_5", "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "name": "batch_normalization_3", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "scale": true, "center": true, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_regularizer": null, "strides": [1, 1], "name": "conv2d_6", "filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "padding": "valid", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"epsilon": 0.001, "name": "batch_normalization_4", "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "gamma_constraint": null, "scale": true, "center": true, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null}, "class_name": "BatchNormalization"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.4}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "name": "dense_1", "units": 128, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "name": "dense_2", "units": 64, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.1}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "name": "dense_3", "units": 32, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "name": "dense_4", "units": 6, "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "softmax", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.8"}